resources/public/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-19 Thu 13:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CONSOL</title>
<meta name="author" content="Nichole Kernreicht" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="doom-monokai.css?v=3">

</head>
<body>
<div id="content" class="content">
<h1 class="title">CONSOL</h1>
<div id="outline-container-org0bdcc0b" class="outline-2">
<h2 id="org0bdcc0b">1. What Consol Is</h2>
<div class="outline-text-2" id="text-org0bdcc0b">
<p>
Consol is a thin, document-native operating layer for small Linux devices.
</p>

<p>
It provides a clear, inspectable control surface over:
</p>
<ul class="org-ul">
<li>system state</li>
<li>services</li>
<li>deployment</li>
<li>events</li>
<li>memory</li>
</ul>

<p>
Consol does not replace the kernel.
Consol does not attempt to be a desktop environment.
Consol does not attempt to be a general-purpose framework.
</p>

<p>
Consol exists to reduce impedance between intent and machine.
</p>
</div>
</div>
<div id="outline-container-orgd64f8b8" class="outline-2">
<h2 id="orgd64f8b8">2. Why Consol Exists</h2>
<div class="outline-text-2" id="text-orgd64f8b8">
<p>
Modern devices are powerful but obscured.
</p>

<p>
We carry multi-core processors and gigabytes of memory in our pockets, yet access to them is increasingly abstracted, opaque, and application-bound.
</p>

<p>
Consol restores:
</p>
<ul class="org-ul">
<li>legibility</li>
<li>inspectability</li>
<li>composability</li>
<li>structural clarity</li>
</ul>

<p>
It does not increase complexity.
It removes unnecessary layers.
</p>
</div>
</div>
<div id="outline-container-orgd0679f2" class="outline-2">
<h2 id="orgd0679f2">3. Core Principles</h2>
<div class="outline-text-2" id="text-orgd0679f2">
</div>
<div id="outline-container-org163d36e" class="outline-3">
<h3 id="org163d36e">Restore Dignity</h3>
<div class="outline-text-3" id="text-org163d36e">
<p>
Machines should be understandable.
</p>
</div>
</div>
<div id="outline-container-org9ed6dbe" class="outline-3">
<h3 id="org9ed6dbe">Minimize Impedance</h3>
<div class="outline-text-3" id="text-org9ed6dbe">
<p>
Nothing unnecessary should sit between intention and execution.
</p>
</div>
</div>
<div id="outline-container-org8e78878" class="outline-3">
<h3 id="org8e78878">Structure Over Cleverness</h3>
<div class="outline-text-3" id="text-org8e78878">
<p>
Prefer simple composable primitives over dense abstraction.
</p>
</div>
</div>
<div id="outline-container-org6b7e810" class="outline-3">
<h3 id="org6b7e810">Documentation Lives With Code</h3>
<div class="outline-text-3" id="text-org6b7e810">
<p>
Public functions require docstrings.
Data shapes are explicit.
No external wikis as primary documentation.
</p>
</div>
</div>
<div id="outline-container-orgce7c42e" class="outline-3">
<h3 id="orgce7c42e">Immutable Substrate</h3>
<div class="outline-text-3" id="text-orgce7c42e">
<p>
All meaningful changes are events.
Derived state must be reproducible.
</p>
</div>
</div>
<div id="outline-container-orgfb2f8e3" class="outline-3">
<h3 id="orgfb2f8e3">Wizard at the REPL, Discipline in the Repository</h3>
<div class="outline-text-3" id="text-orgfb2f8e3">
<p>
Exploration is free.
Committed code is calm and readable.
</p>
</div>
</div>
</div>
<div id="outline-container-orgce7a5c6" class="outline-2">
<h2 id="orgce7a5c6">4. Architectural Model</h2>
<div class="outline-text-2" id="text-orgce7a5c6">
<p>
Consol is composed of four layers:
</p>
</div>
<div id="outline-container-org0d94f73" class="outline-3">
<h3 id="org0d94f73">Core</h3>
<div class="outline-text-3" id="text-org0d94f73">
<ul class="org-ul">
<li>Event model</li>
<li>Datalevin backing store</li>
<li>Immutable logic</li>
</ul>
</div>
</div>
<div id="outline-container-org355b9c0" class="outline-3">
<h3 id="org355b9c0">IO Edge</h3>
<div class="outline-text-3" id="text-org355b9c0">
<ul class="org-ul">
<li>HTTP</li>
<li>File system</li>
<li>Git</li>
<li>Process invocation</li>
</ul>
</div>
</div>
<div id="outline-container-orgedab65d" class="outline-3">
<h3 id="orgedab65d">Surface</h3>
<div class="outline-text-3" id="text-orgedab65d">
<ul class="org-ul">
<li>Minimal HTML rendering</li>
<li>Text-first presentation</li>
<li>Black/white readable</li>
</ul>
</div>
</div>
<div id="outline-container-org9eb9627" class="outline-3">
<h3 id="org9eb9627">Commands</h3>
<div class="outline-text-3" id="text-org9eb9627">
<ul class="org-ul">
<li>deploy</li>
<li>restart</li>
<li>inspect</li>
<li>status</li>
</ul>

<p>
Layers must not bleed into one another.
</p>
</div>
</div>
</div>
<div id="outline-container-org0f40c05" class="outline-2">
<h2 id="org0f40c05">5. Event Model</h2>
<div class="outline-text-2" id="text-org0f40c05">
<p>
Everything meaningful is an event.
</p>

<p>
Each event must contain:
</p>
<ul class="org-ul">
<li>type</li>
<li>timestamp</li>
<li>actor</li>
<li>payload</li>
<li>version</li>
</ul>

<p>
State is derived from events.
State is never silently mutated.
</p>
</div>
</div>
<div id="outline-container-orgf165d83" class="outline-2">
<h2 id="orgf165d83">6. Code Standards</h2>
<div class="outline-text-2" id="text-orgf165d83">
<ul class="org-ul">
<li>One idea per file.</li>
<li>Top-of-file contract comment.</li>
<li>All public functions include docstrings.</li>
<li>No deeply nested anonymous lambdas.</li>
<li>No clever naming.</li>
<li>Clear English identifiers.</li>
<li>Prefer small functions.</li>
</ul>

<p>
The goal is not minimal lines of code.
The goal is maximal clarity.
</p>
</div>
</div>
<div id="outline-container-orgd8fdcf9" class="outline-2">
<h2 id="orgd8fdcf9">7. Visual Language</h2>
<div class="outline-text-2" id="text-orgd8fdcf9">
<p>
Consol is:
</p>
<ul class="org-ul">
<li>Text-first</li>
<li>Minimal</li>
<li>Monospace-forward</li>
<li>Black-and-white legible</li>
<li>Print-friendly</li>
<li>Free of decorative animation</li>
</ul>

<p>
The surface is a lens, not a spectacle.
</p>
</div>
</div>
<div id="outline-container-org60754b5" class="outline-2">
<h2 id="org60754b5">8. Scope of 0.1</h2>
<div class="outline-text-2" id="text-org60754b5">
<p>
Consol 0.1 includes:
</p>
<ul class="org-ul">
<li>HTTP control surface</li>
<li>Datalevin event store</li>
<li>Basic deploy command</li>
<li>Status view</li>
<li>Service registry</li>
</ul>

<p>
Consol 0.1 excludes:
</p>
<ul class="org-ul">
<li>authentication systems</li>
<li>plugin systems</li>
<li>analytics dashboards</li>
<li>embedded LLM features</li>
<li>over-abstraction</li>
</ul>

<p>
0.1 is defined by coherence, not features.
</p>
</div>
</div>
<div id="outline-container-orgfcf116a" class="outline-2">
<h2 id="orgfcf116a">9. Identity</h2>
<div class="outline-text-2" id="text-orgfcf116a">
<p>
Con Sol is the symbolic observer of the operating layer.
</p>

<p>
He is observant.
He values clarity.
He reduces friction.
</p>

<p>
Consol is a lens over small machines.
</p>

<p>
{{echo*}}
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Nichole Kernreicht (<a href="mailto:nicholekernreicht@M1-MBP.local">nicholekernreicht@M1-MBP.local</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.2 (<a href="https://orgmode.org">Org</a> mode 9.7.39)</p>
<p class="validation"></p>
</div>
</body>
</html>
